src/load-generator/scenario.yml
config:
  target: "http://localhost:8888"
  phases:
    - duration: 0
      arrivalRate: 1
  processor: "./helpers.js"

scenarios:
  - name: "Test"
    beforeScenario:
      - getAllProducts
      - solveAccessToken
    flow:
      - get:
          url: "/home"
          beforeRequest: addRequestAuth
      - think: 1
      - get:
          url: "/catalog"
          beforeRequest: addRequestAuth
      - think: 2
      - loop:
          - get:
              url: "/catalog/{{ $loopElement }}"
              beforeRequest: addRequestAuth
          - think: 1
        over: allProducts
      - think: 1
      - post:
          url: "/cart"
          beforeRequest:
            - setRandomProductId
            - addRequestAuth
          form:
            productId: "dummy"
      - think: 1
      - get:
          url: "/cart"
          beforeRequest: addRequestAuth
      - think: 2
      - get:
          url: "/checkout"
          beforeRequest: addRequestAuth
      - think: 3
      - post:
          url: "/checkout"
          form:
            firstName: John
            lastName: Doe
            email: jdoe789@example.com
            address1: 123 Main Street
            address2:
            city: New York
            state: NY
            zip: 12345
          beforeRequest: addRequestAuth
      - think: 2
      - post:
          url: "/checkout/delivery"
          form:
            token: priority-mail
          beforeRequest: addRequestAuth
      - think: 2
      - post:
          url: "/checkout/confirm"
          beforeRequest: addRequestAuth