src/load-generator/scenario.yml
config:
  target: "http://localhost:8888"
  phases:
    - duration: 0
      arrivalRate: 1
  processor: "./helpers.js"

scenarios:
  - name: "Test"
    beforeScenario: getAllProducts
    flow:
      - get:
          url: "/home"
      - think: 1
      - get:
          url: "/catalog"
      - think: 2
      - loop:
          - get:
              url: "/catalog/{{ $loopElement }}"
          - think: 1
        over: allProducts
      - think: 1
      - post:
          url: "/cart"
          beforeRequest: setRandomProductId
          form:
            productId: "dummy"
      - think: 1
      - get:
          url: "/cart"
      - think: 2
      - get:
          url: "/checkout"
      - think: 3
      - post:
          url: "/checkout"
          form:
            firstName: John
            lastName: Doe
            email: jdoe789@example.com
            address1: 123 Main Street
            address2:
            city: New York
            state: NY
            zip: 12345
      - think: 2
      - post:
          url: "/checkout/delivery"
          form:
            token: priority-mail
      - think: 2
      - post:
          url: "/checkout/confirm"